{
"help":"The goal of the game is to guess the current gregtech item correct. Here's a breakdown of all the commands:\n- **answer**: Used to submit your guess on what the item is.\n- **a**: Shortcut for /answer.\n- **score**: Shows the leaderboard on who has the highest score, you can also select specific pages.\n- **userscore**: Shows your own score, along with the 5 people ahead of you and 4 people behind. You can also specify a user.\n- **skip**: Skips the current image. Requires 10 minutes to have passed, and 3 people to use the command, all of which must have used all 3 guesses. Alternatively, if 30 minutes have passed, a single user can skip, regardless of guess count.\n",
"version":"1.1.3",
"1.0.1":"- Added max answer length",
"1.1.0":"- Update replaces.json to include substation hatches, 'hex':'16X' is now 'hex_':'16X ' to prevent getting mixed up with any images with hex in their name.\n- upper.json how requires spaces after every voltage tier to prevent conflits.\n- Fix scoreboard. No longer generates ghost entries with usernames instead of user id's when using the /score command. Numbering is now correct, for example page 2 now starts at 11 instead of 10.\n- Added /skip command, requires 3 people that have used all 3 guesses to skip after 10 minutes have passed since the last image.\n- Add info command to access changelogs and help.\n- Add info subcommands: `1.0.1`, `1.1.0`, `help`.\n- Add reduceproblist.txt, so when an image with any keywords in the list are found, it re-rolls.\n- quit is now a slash command.\n- /image command description now specifies that it is admin-only.\n- Added warnings when you have 1 and 0 guesses left.",
"1.1.1":"- Add version subcommand\n- Fix error message when invalid subcommand is used.",
"1.1.2":"- Update 1.1.0 changelog, now notes guess warnings. It also contains proper capitalization.\n- Update reduceproblist to add `refined`, `crushed`, and `pure`.\n- Fix skip command to not reset everytime it is used, which made the 10 minute version useless.\n- Update replaces.json flowing~ -> flowing_ (oops). Also added aluminum => aluminium\n",
"1.1.3":"- Reduce time to /skip to 5 minutes.\n- Fix bug where /skip amount would not reset with new images.\n- Reduced people required to skip from 3 -> 2."
}
